# DCFW-1800-series
### 恢复出厂设置1800——DCFW-1800
《网络搭建与应用》专业技能大赛采用的设备是神州数码产品，所以大家平时训练用的都是下表中神州数码设备。

今天给大家讲讲神州数码路由器、交换机和防火墙如何用串口CLI命令恢复出厂设置。

首先，用标准的RS-232线缆连接路由器、交换机或防火墙上console接口和电脑串口，也可以用RS232转USB数据线接在电脑的USB口（这时需要安装驱动），打开SecureCRT超级终端建立连接。

其次用SecureCRT超级终端建立连接时注意连接参数设置：

三层交换机CS6200端口选COM1，波特率选115200

而二层交换机S4600、无线交换机DCWS-6028、路由器DCR-2855、防火墙DCFW-1800E端口选COM1，波特率选9600。

如果选RS232转USB数据线接在电脑的USB口，连接时还要注意端口，一般是COM3。

还有路由器和防火墙缺省登陆用户名：admin，密码：admin。

最后在SecureCRT超级终端下输入CLI命令恢复出厂设置：

三层交换机CS6200、二层交换机S4600、无线交换机DCWS-6028恢复出厂设置命令：

特权模式下：Switch#set default

Switch#write

Switch#reload

2.路由器DCR-2855恢复出厂设置命令：

特权模式下：Router#delete startup-config

Router#reboot

3.防火墙DCFW-1800E恢复出厂设置命令：

### 特权模式下：DCFW-1800#unset all
一、打开超级终端建立连接

用标准的RS-232线缆连接交换机上console接口和电脑串口，打开 putty_v0.6.0 超级终端建立连接。

二、防火墙加电重启等待出现“Boot OS…”时输入“entershell”命令

当出现“Boot OS…”提示后，大概8秒钟才可以输入字符，可以多按几次回车，发现有反应时再输入“entershell”命令也不急，大概会等待15秒左右，出现#号即可。

> LMC0 init.........................done

DRAM: 2 GB

BOOTROM: 512 KB

Press ESC to stop autoboot: 0

Loading DCFOS-3-5.0R4P14.bin

##################################################

Load complete: 41562112 bytes loaded

Boot OS...

entershell

BusyBox v1.20.2 (2014-02-17 20:50:45 CST) built-in shell (ash)

Enter 'help' for a list of built-in commands.

~ #

![](https://cdn.nlark.com/yuque/0/2023/png/34846357/1696827186705-7708b3f4-589e-4704-9617-6a3f4d135ef5.png)

三、进入设备的配置文件目录查看配置文件

~ # cd flash/config //进入配置文件夹

/wr_point/etc/mnt/mtdblock4/config # ls -l //列表显示所有文件

total 280

-rw-r--r-- 1 root root 29427 Sep 1 11:55 config.0

-rw-r--r-- 1 root root 29224 Sep 3 11:13 config.1

-rw-r--r-- 1 root root 25108 Sep 25 15:51 config.2

-rw-r--r-- 1 root root 25108 Sep 25 15:54 config.3

-rw-r--r-- 1 root root 25108 Sep 25 15:54 config.4

-rw-r--r-- 1 root root 26420 Aug 18 10:02 config.5

-rw-r--r-- 1 root root 31116 Aug 18 17:46 config.6

-rw-r--r-- 1 root root 31219 Aug 19 20:22 config.7

-rw-r--r-- 1 root root 28781 Aug 20 13:37 config.8

-rw-r--r-- 1 root root 28611 Aug 20 20:05 config.9

-rw-r--r-- 1 root root 1522 Sep 25 15:54 config.conf

-rw-r--r-- 1 root root 1621 Sep 25 15:54 vsys_config.conf

/wr_point/etc/mnt/mtdblock4/config #

![](https://cdn.nlark.com/yuque/0/2023/png/34846357/1696827186588-c62efe59-2715-48b0-8359-4efd5b0129fb.png)

如果设备存在多个配置文件，如 config.x，x值最大的为当前配置文件，也是我们需要进行修改的配置文件，如此时的当前配置文件为 config.9

四、备份当前配置文件，以防万一

/wr_point/etc/mnt/mtdblock4/config # cp config.9 config.9.bak

/wr_point/etc/mnt/mtdblock4/config #ls -l

五、查看配置文件内容，并复制到桌面txt文档里编辑，修改用户密码

使用 vi 编辑器打开 config.9 配置文件时，好像权限被限制了，底部提示一条错误信息：

vi:can’t read user input

由于使用 vi 编辑器无相关权限，改用 more 指令查看配置文件内容，并复制内容到本地txt文档里编辑替换。如果配置文件比较大，需要把 PuTTY配置中的“回滚行数”参数调高一些，本例为“20000”，不然文本内容显示不全。

![](https://cdn.nlark.com/yuque/0/2023/png/34846357/1696827186829-d96114b6-2250-404e-acab-e70b91440fcf.png)

使用 more config.9 指令来显示文本内容

/wr_point/etc/mnt/mtdblock4/config # more config.9

然后将屏幕上这些配置内容拷贝到记事本里，随意取个名称，如 config.txt，打开此config.txt文件，修改管理员密码部分内容。

找到“password DE8Dl5mdnRmyjqXoB9ZB5QfA6t”，把加密的密文修改为 “admin”，则密码就为“admin”

六、在神州数码防火墙设备中创建config.text文件，复制配置文件内容到设备中

输入 cat>>config.text<<EOF 指令，将config.txt中的内容粘贴在下面，输入 EOF 结束输入，这样就产生了一个 config.text文件。
```
/wr_point/etc/mnt/mtdblock4/config # cat>>config.text<<EOF

>

>

结束输入EOF

>EOF
```


七、检测 config.text 文件

/wr_point/etc/mnt/mtdblock4/config #ls -l

/wr_point/etc/mnt/mtdblock4/config # more config.text //查看密码是否修改成功

/wr_point/etc/mnt/mtdblock4/config # cmp config.text config.9 //对比两个文件内容

![](https://cdn.nlark.com/yuque/0/2023/png/34846357/1696827186797-7705b4eb-86f9-4532-98dc-100978b5af73.png)

八、覆盖设备启动文件

将 config.test 文件覆盖 config.9文件

/wr_point/etc/mnt/mtdblock4/config # cp config.text config.9 //拷贝文件，已存在会覆盖

![](https://cdn.nlark.com/yuque/0/2023/png/34846357/1696827187188-8b219e02-2b0e-4a07-9b0a-84ca6a749cc4.png)

九、再次确认 config.9 配置文件的密码是否已经被重置

/wr_point/etc/mnt/mtdblock4/config #more config.9 //再次查看密码是否修改成功

/wr_point/etc/mnt/mtdblock4/config # cmp config.text config.9 //对比两个文件内容

![](https://cdn.nlark.com/yuque/0/2023/png/34846357/1696827187206-1b110796-b45f-4cdc-9e9c-e3a429ba9f2f.png)

十、重启系统

确认config.9的正确性后，输入 reboot 重启防火墙，这样密码就恢复了，配置文件不变。

/wr_point/etc/mnt/mtdblock4/config # reboot

The system is going down NOW!onfig #

Requesting system reboot


# WAF
登录

普通用户：admin yunke1234！

恢复出厂设置

factoryreset -R 命令用来对设备进行常规恢复出厂操作。


# DCBC-NetLog
账号

命令行

root/recovery root*PWD

![](https://cdn.nlark.com/yuque/0/2023/png/34846357/1696847944211-98417269-d883-41e4-b351-4f46f4c7cfa8.png)

WEB

admin admin*PWD


# CS6200
### 基本配置
```
CS6200-28X-EI#set default 清空当前配置

一、实验目的

1、了解交换机的文件管理。

2、了解什么时候需要将交换机恢复成出厂设置。

3、了解交换机恢复出厂设置的方法。

4、了解交换机的一些基本配置命令。

二、应用环境

1、实际环境下举例如下：

教学楼的交换机坏了，网络管理员把实验楼的一台交换机拿过去先用着。这台交换机的配置是按照实验楼的环境配置的，我需要改成教学楼的环境，一条条修改比较麻烦，也不能保证正确，不如清空交换机的所有配置，恢复到刚刚出厂的状态。

比如你正在配置一台交换机，，做了很多功能的配置，完成之后发现它不能正常工作。问题出在哪里了？你检查了很多遍都没有发现错误，排错的难度远远大于重新配置，不如清空交换机的所有配置，恢复到出厂状态重新配置。

三、实验设备

1、神州数码DCN-CS6200 交换机 1 台

2、PC 机 1 台

3、Console 线 1 根

四、实验拓扑

五、实验要求

1、先给交换机设置enable密码，确定enable密码设置成功。

2、对交换机做恢复出厂设置，重新启动后发现enable密码消失，表示恢复成功。

3、了解 show flash 、clock set 、hostname 、language 命令及显示内容。

六、实验步骤

第一步：为交换机设置enable密码。

CS6200-28X-EI>enable

CS6200-28X-EI#config

CS6200-28X-EI(config)#enable password admin

验证方法有两种：1、exit退出到一般用户模式，然后重新进入交换机。2、用show running-config命令查看是否配置成功。

第二步：清空交换机的配置。

CS6200-28X-EI#set default 清空当前配置

Are you sure? [Y/N] = y 确定

CS6200-28X-EI#write 保存当前配置

Sep 14 02:51:53:000 2022 CS6200-28X-EIMODULE_CONFIG_SHELL/3/:Switch configuration has been set default!

NULL(factory config) will be used as the startup-config file at the next time!

CS6200-28X-EI#reload 重启交换机

Process with reboot? [Y/N] y 确定

第三步：了解 show flash 命令

CS6200-28X-EI(config)#show flash 。

-rw- 16.5M nos.img 配置文件

-rw- 2.5K startup.cfg

-rw- 47 vsf.cfg 厂家信息

Drive : flash:

Size:29.5M Used:17.6M Available:11.9M Use:60%

第四步：设置交换机的系统日期和时钟。

CS6200-28X-EI#clock set ? 查询后面命令的格式

HH:MM:SS Hour:Minute:Second

CS6200-28X-EI#clock set 11:25:25 ? 输入时间继续查询后面的格式

YYYY.MM.DD Year.Month.Day(Valid time is between 2001.1.1 and 2037.12.31)<cr>

CS6200-28X-EI#clock set 11:25:25 2022.9.14 输入日期即可

Current time is Wed Sep 14 11:25:25 2022 [UTC]

验证命令：输入show clock 就可以查询你配置的时间日期了。

第五步：设置“？”所显示信息的语言类型。

CS6200-28X-EI(config)#language chinese 选择语言为中文

CS6200-28X-EI(config)#language ?

chinese 设置语言为中文

english 设置语言为英语

（如果设置好以后还是没显示中文就去设置找到外观有个字符编码选择“简体中文”就可以了）

七、配置命令详解

命令：clock set <HH:MM:SS> <YYYY/MM/DD>

功能：设置系统日期和时钟。

参数：<HH:MM:SS>为当前时钟，HH 取值范围为 0~23，MM 和 SS 取值范围为 0~59；<YYYY/MM/DD >为当前年、月和日，YYYY 取值范围为 2000~2100，MM 取值范围为 1~12，DD 取值范围为 1~31。

命令模式：特权用户配置模式

缺省情况：系统启动时缺省为 Sun Jan 01 00:01:51 2006

使用指南：交换机在断电后不能继续计时，而且设置的时间在交换机重启或者断点情况下再重新启动会恢复出厂的时间。

命令：hostname <hostname>

功能：设置交换机命令行界面的提示符。

参数：<hostname>为提示符的字符串。

命令模式：全局配置模式

缺省情况：系统缺省提示符为” DCS-3950-28C”

使用指南：通过本命令用户可以根据实际情况设置交换机命令行的提示符。

命令：language {chinese|english}

功能：设置显示的帮助信息的语言类型。

参数：chinese 为中文显示；english 为英文显示。

命令模式：特权用户配置模式

缺省情况：系统缺省英文显示。

使用指南：DCS-3950-28C 提供了两种语言的帮助信息，用户可根据自己的喜好选择语言

类型。系统若重启后，帮助显示信息恢复为英文显示。

命令：reload

功能：热启动交换机。

命令模式：特权用户配置模式

使用指南：用户可以通过本命令，在不关闭电源的情况下，重新启动交换机。

命令：set default

功能：恢复交换机的出厂设置。

命令模式：特权用户配置模式

使用指南：恢复交换机的出厂设置，即用户对交换机做的所有配置都消失，用户重新启动交换机后，出现的提示与交换机首次上电一样。

注意：配置本命令后，必须执行 write 命令，进行配置保留后重启交换机即可使交换机恢复到出厂设置。

命令：show flash

功能：显示保存在 flash 中的文件及大小。

命令模式：特权用户配置模式
```
### 密码恢复（DCWS适用）

```
应用背景：

客户遗忘了交换机的密码

操作序列：

 通过 ctrl+b 进入 Boot 模式

 使用 boot startup-config null 命令，并 reboot

 Img 模式下，type startup.cfg 获取原配置中的密码

 Img 模式下，boot startup-config startup.cfg 将配置文件作为启动文件

具体为：

 进入 boot 模式，并进行如下配置

[Boot]: boot startup-config null

看到提示信息：default factory-config will be used. 后，输入 reboot 设备重启，将以出厂配置启动。

 进入 img 模式，进行如下操作

在特权模式下，输入命令 type startup.cfg，可以读取设备的配置，从而获取密码。

Switch#type startup.cfg

no service password-encryption

!

hostname Switch

sysLocation China

sysContact 400-810-9119

!

enable password level 15 0 dcn_123

!

username admin privilege 15 password 0 admin

…(省略后续部分)

如果密码为明文，则直接能够获取到；如果密码为密文，则请获取其他配置项，重新刷入配

置，密码重新配置后，write 保存。获取到密码或重新完成配置后，执行如下操作

Switch#boot startup-config startup.cfg

flash:/startup.cfg will be used as the startup-config file at the next time!

重启设备后，即还原为之前设备配置。
```
# DCWS-6028-Pro
账号

admin admin